# var = 1
# print(var)
# print(type(var))        #тип данных
# print(id(var))          #адрес объекта в памяти. Адрес уникален и неизменен в течение всей жизни объекта

# #ИСКЛЮЧЕНИЕ! если разным переменным присваивается одинаковое число, то ИД этих переменных будет одним. Значение будет храниться в одной ячейке памяти, а разные переменные будут просто на него ссылаться

# a = 5
# b = 5

# print(id(a))
# print(id(b)) 

# b = b + 1

# print(id(b))        #А вот сейчас адрес переменной Б изменился


